fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Минкова - Заполнение регистра ВКМ_ВыполненныеКлиентуРаботы - 21.02.2025
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК КоличествоЧасы
		|ПОМЕСТИТЬ ВТ_ВыполненныеРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
		|	ЕСТЬNULL(ВТ_ВыполненныеРаботы.КоличествоЧасы, 0) КАК КоличествоЧасы,
		|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы, 0) * ЕСТЬNULL(ВТ_ВыполненныеРаботы.КоличествоЧасы, 0) КАК
		|		СуммаКОплате,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Период
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполненныеРаботы КАК ВТ_ВыполненныеРаботы
		|		ПО ВКМ_ОбслуживаниеКлиента.Ссылка = ВТ_ВыполненныеРаботы.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	Запрос.УстановитьПараметр("Период", Дата);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
	
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	
	Если Выборка.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентсткоеОбслуживание") Тогда
	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Выбран некорректный договор - %1.", Выборка.Договор);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если ДатаПроведенияРабот < Выборка.ВКМ_ДатаНачалаДействияДоговора Или ДатаПроведенияРабот > Выборка.ВКМ_ДатаОкончанияДействияДоговора Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Дата проведения работ не соответсвует периоду действия договора %1.", Выборка.Договор);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;

	КонецЕсли;
		
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	

	Движение.СуммаКОплате = Выборка.СуммаКОплате;
	Движение.КоличествоЧасов = Выборка.КоличествоЧасы;
	
	
КонецПроцедуры

	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Минкова - При создании/изменении документа формирует сообщение - 01.03.2025

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;


	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Специалист", Строка(Специалист));
	ДанныеДокумента.Вставить("НовыйДокумент", Ложь);
	ДанныеДокумента.Вставить("ДокументИзменился", Ложь);
	ДанныеДокумента.Вставить("ДатаПроведенияРабот", Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));
	ДанныеДокумента.Вставить("ВремяНачалаРабот", Формат(ВремяНачалаРабот, "ДФ=HH:mm;"));
	ДанныеДокумента.Вставить("ВремяОкончанияРабот", Формат(ВремяОкончанияРабот, "ДФ=HH:mm;"));

	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);		
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
		
	Если Не Выборка.Следующий() Тогда
		
		ДанныеДокумента.НовыйДокумент = Истина;
		ДанныеДокумента.ДокументИзменился = Истина;
		
	Иначе
		
		Если Выборка.Специалист <> Специалист Тогда
			ДанныеДокумента.Специалист = СтрШаблон("Изменен с %1 на %2", Выборка.Специалист, ДанныеДокумента.Специалист);			
			ДанныеДокумента.ДокументИзменился = Истина;		
		КонецЕсли;
		
		Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
			ДанныеДокумента.ДатаПроведенияРабот = СтрШаблон("Изменилась с %1 на %2", Формат(Выборка.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), ДанныеДокумента.ДатаПроведенияРабот);			
			ДанныеДокумента.ДокументИзменился = Истина;
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
			ДанныеДокумента.ВремяНачалаРабот = СтрШаблон("Изменилось с %1 на %2", Формат(Выборка.ВремяНачалаРабот, "ДФ=HH:mm;"), ДанныеДокумента.ВремяНачалаРабот);			
			ДанныеДокумента.ДокументИзменился = Истина;
		КонецЕсли;

		Если Выборка.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
			ДанныеДокумента.ВремяОкончанияРабот = СтрШаблон("Изменилось с %1 на %2", Формат(Выборка.ВремяОкончанияРабот, "ДФ=HH:mm;"), ДанныеДокумента.ВремяОкончанияРабот);			
			ДанныеДокумента.ДокументИзменился = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеДокумента.НовыйДокумент Тогда
		СтатусДокумента = "Новый документ"
	Иначе 
		СтатусДокумента = "Документ изменен";
	КонецЕсли;
		
	Если ДанныеДокумента.ДокументИзменился Тогда
		ТекстСообщения = СтрШаблон("Статус документа: %1. 
		|Специалист: %2. 
		|Дата проведения работ: %3.
		|Время начала работ: %4. 
		|Время окончания рабоот: %5.", 
				СтатусДокумента,
				ДанныеДокумента.Специалист,
				ДанныеДокумента.ДатаПроведенияРабот,
				ДанныеДокумента.ВремяНачалаРабот,
				ДанныеДокумента.ВремяОкончанияРабот);
				
		СформироватьТекстУведомленияТелеграмБоту(ТекстСообщения);

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//// Минкова - Процедура создания элемента справочника ВКМ_УведомленияТелеграмБоту - 01.03.2025
Процедура СформироватьТекстУведомленияТелеграмБоту(ТекстСообщения)
	
	УведомлениеТелеграмБоту = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	УведомлениеТелеграмБоту.ТекстСообщения = ТекстСообщения;
	УведомлениеТелеграмБоту.Записать();	
	
КонецПроцедуры	

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
